# Написать программу камень ножницы бумага по памяти (готово по своему)
# Создать массив имен с помощью %w{...}, вывести все имена с порядковым номеров с помощью arr.each_with_index (Готово)
# Англо-русский словарь, то, что мы сейчас делали. Простой Сделал, частично списал
# Сложный англо-русский словарь hh = {'cat' => ['кот', 'кошка']} Будет выводить:
# 1) колличество переводов слова 2) сами переводы
# Колличество переводов слова: 2
# Переводы:
# кот
# кошка
#написал, код получился правильным и работает, нужно досконально разобраться что я сделал и как это работает
#
#
