print "How much will we set aside per month: "
x=gets.to_f  #Вводимо перемінну, яка буду приймати значення нашої суми, яку ми будемо відкладати

print "How many years: "
y=gets.to_i #Вводимо перемінну, яка буде показувати скільки саме років ми будемо накоплювати

s=0 #вводимо перемінну, за допомогою якої будемо рахувати накопичення, дорівнює 0, щоб до неї додавати число і починати відлік з 0, в теорії можна написати тут не 0, а ту цифру яка у вас всже є

1.upto(y)do|years| #методом АпТу ведемо на екран блок ту кількість разів, яку буде вказано в y. Перемінні years буде використовуватись для вставляння чисел від 1 до y.
	1.upto(12) do|mm| #mm буде використовуватись для вставляння чисел від 1 до 12 
	s=s+x #данна формула потрібна для введення її в вивід, кількість буде дорівнювати кількості mm, показує накопичення
	puts "Year #{years} month #{mm}: #{s}" #це все внутрішній блок у блоці рік, він буде виконуватись 12 разів, потім верхній блок запуститься знову, ту кількість разів яку буде складати y і далі цей блок знову пройде 12 разів
	end
end
